{
  "title": "Tractatus logico-philosophicus",
  "author": "Ludvig Wittgenstein",
  "translator": "C.K. Odgen",
  "release date": "October 22, 2010",
  "source": "https://www.gutenberg.org/files/5740/5740-pdf.pdf",
  "content": {
    "propositions": [
      {
        "number": "1",
        "proposition": "The world is everything that is the case.*",
        "notes": ["*"],
        "propositions": [
          {
            "number": "1.1",
            "proposition": "The world is the totality of facts, not of things.",
            "propositions": [
              {
                "number": "1.11",
                "proposition": "The world is determined by the facts, and by these being all the facts."
              },
              {
                "number": "1.12",
                "proposition": "For the totality of facts determines both what is the case, and also all that is not the case."
              },
              {
                "number": "1.13",
                "proposition": "The facts in logical space are the world."
              }
            ]
          },
          {
            "number": "1.2",
            "proposition": "The world divides into facts.",
            "propositions": [
              {
                "number": "1.21",
                "proposition": "Any one can either be the case or not be the case, and everything else remain the same."
              }
            ]
          }
        ]
      },
      {
        "number": "2",
        "proposition": "What is the case, the fact, is the existence of atomic facts.",
        "propositions": [
          {
            "number": "2.01",
            "proposition": "An atomic fact is a combination of objects (entities, things).",
            "propositions": [
              {
                "number": "2.011",
                "proposition": "It is essential to a thing that it can be a constituent part of an atomic fact."
              },
              {
                "number": "2.012",
                "proposition": "In logic nothing is accidental: if a thing can occur in an atomic fact the possibility of that atomic fact must already be prejudged in the thing.",
                "propositions": [
                  {
                    "number": "2.0121",
                    "proposition": "It would, so to speak, appear as an accident, when to a thing that could exist alone on its own account, subsequently a state of affairs could be made to fit. If things can occur in atomic facts, this possibility must already lie in them."
                  }
                ]
              }
            ]
          }
        ]
      }
    ],
    "notes": [
      {
        "number": "*",
        "note": "The decimal figures as numbers of the separate propositions indicate the logical importance of the propositions, the emphasis laid upon them in my exposition. The propositions n.1, n.2, n.3, etc., are comments on proposition No. n; the propositions n.m1, n.m2, etc., are comments on the proposition No. n.m; and so on."
      }
    ]
  }
}
